In [1]:
import numpy as np
import pandas as pd
import tensorflow as tf

ratings_df = pd.read_csv('ratings.csv')

In [5]:
ratings_df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userId</th>
      <th>movieId</th>
      <th>rating</th>
      <th>timestamp</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>99999</th>
      <td>671</td>
      <td>6268</td>
      <td>2.5</td>
      <td>1065579370</td>
    </tr>
    <tr>
      <th>100000</th>
      <td>671</td>
      <td>6269</td>
      <td>4.0</td>
      <td>1065149201</td>
    </tr>
    <tr>
      <th>100001</th>
      <td>671</td>
      <td>6365</td>
      <td>4.0</td>
      <td>1070940363</td>
    </tr>
    <tr>
      <th>100002</th>
      <td>671</td>
      <td>6385</td>
      <td>2.5</td>
      <td>1070979663</td>
    </tr>
    <tr>
      <th>100003</th>
      <td>671</td>
      <td>6565</td>
      <td>3.5</td>
      <td>1074784724</td>
    </tr>
  </tbody>
</table>
</div>

In [6]:
ratings_df.size

400016

In [7]:
movies_df=pd.read_csv('movies.csv')

In [8]:
movies_df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>movieId</th>
      <th>title</th>
      <th>genres</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>9120</th>
      <td>162672</td>
      <td>Mohenjo Daro (2016)</td>
      <td>Adventure|Drama|Romance</td>
    </tr>
    <tr>
      <th>9121</th>
      <td>163056</td>
      <td>Shin Godzilla (2016)</td>
      <td>Action|Adventure|Fantasy|Sci-Fi</td>
    </tr>
    <tr>
      <th>9122</th>
      <td>163949</td>
      <td>The Beatles: Eight Days a Week - The Touring Y...</td>
      <td>Documentary</td>
    </tr>
    <tr>
      <th>9123</th>
      <td>164977</td>
      <td>The Gay Desperado (1936)</td>
      <td>Comedy</td>
    </tr>
    <tr>
      <th>9124</th>
      <td>164979</td>
      <td>Women of '69, Unboxed</td>
      <td>Documentary</td>
    </tr>
  </tbody>
</table>
</div>

In [9]:
movies_df['movieRow'] = movies_df.index

In [10]:
movies_df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>movieId</th>
      <th>title</th>
      <th>genres</th>
      <th>movieRow</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>9120</th>
      <td>162672</td>
      <td>Mohenjo Daro (2016)</td>
      <td>Adventure|Drama|Romance</td>
      <td>9120</td>
    </tr>
    <tr>
      <th>9121</th>
      <td>163056</td>
      <td>Shin Godzilla (2016)</td>
      <td>Action|Adventure|Fantasy|Sci-Fi</td>
      <td>9121</td>
    </tr>
    <tr>
      <th>9122</th>
      <td>163949</td>
      <td>The Beatles: Eight Days a Week - The Touring Y...</td>
      <td>Documentary</td>
      <td>9122</td>
    </tr>
    <tr>
      <th>9123</th>
      <td>164977</td>
      <td>The Gay Desperado (1936)</td>
      <td>Comedy</td>
      <td>9123</td>
    </tr>
    <tr>
      <th>9124</th>
      <td>164979</td>
      <td>Women of '69, Unboxed</td>
      <td>Documentary</td>
      <td>9124</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
movies_df = movies_df[['movieRow', 'movieId', 'title']]

In [12]:
movies_df.to_csv('moviesProcessed.csv',index=False,header=True,encoding='utf-8')

In [13]:
movies_df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>movieRow</th>
      <th>movieId</th>
      <th>title</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>9120</th>
      <td>9120</td>
      <td>162672</td>
      <td>Mohenjo Daro (2016)</td>
    </tr>
    <tr>
      <th>9121</th>
      <td>9121</td>
      <td>163056</td>
      <td>Shin Godzilla (2016)</td>
    </tr>
    <tr>
      <th>9122</th>
      <td>9122</td>
      <td>163949</td>
      <td>The Beatles: Eight Days a Week - The Touring Y...</td>
    </tr>
    <tr>
      <th>9123</th>
      <td>9123</td>
      <td>164977</td>
      <td>The Gay Desperado (1936)</td>
    </tr>
    <tr>
      <th>9124</th>
      <td>9124</td>
      <td>164979</td>
      <td>Women of '69, Unboxed</td>
    </tr>
  </tbody>
</table>
</div>

In [14]:
ratings_df=pd.merge(ratings_df,movies_df,on='movieId')

In [15]:
ratings_df.tail()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userId</th>
      <th>movieId</th>
      <th>rating</th>
      <th>timestamp</th>
      <th>movieRow</th>
      <th>title</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>99999</th>
      <td>664</td>
      <td>64997</td>
      <td>2.5</td>
      <td>1343761859</td>
      <td>7127</td>
      <td>War of the Worlds (2005)</td>
    </tr>
    <tr>
      <th>100000</th>
      <td>664</td>
      <td>72380</td>
      <td>3.5</td>
      <td>1344435977</td>
      <td>7383</td>
      <td>Box, The (2009)</td>
    </tr>
    <tr>
      <th>100001</th>
      <td>665</td>
      <td>129</td>
      <td>3.0</td>
      <td>995232528</td>
      <td>115</td>
      <td>Pie in the Sky (1996)</td>
    </tr>
    <tr>
      <th>100002</th>
      <td>665</td>
      <td>4736</td>
      <td>1.0</td>
      <td>1010197684</td>
      <td>3713</td>
      <td>Summer Catch (2001)</td>
    </tr>
    <tr>
      <th>100003</th>
      <td>668</td>
      <td>6425</td>
      <td>1.0</td>
      <td>993613478</td>
      <td>4635</td>
      <td>6th Man, The (Sixth Man, The) (1997)</td>
    </tr>
  </tbody>
</table>
</div>